# 01. Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 02. Import Data

## Import Products.csv from original data folder

In [3]:
path = r"C:\Users\wallm\11 2024 Instacart Basket Analysis 1"

In [371]:
path

'C:\\Users\\wallm\\11 2024 Instacart Basket Analysis 1'

In [5]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

## Import Orders_wrangled.csv from prepared data folder

In [7]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 03. Mixed Type data

In [9]:
# Crate a dataframe
df_test = pd.DataFrame()

In [11]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [13]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [72]:
# Check for any mixed-type columns
for col in df_test.columns.tolist():
    weird = (df_test[col].map(type) != df_test[col].iloc[0].__class__).any()
    if weird:
        print(col)

In [74]:
# convert a column’s data type from numeric to string
df_test['mix'] = df_test['mix'].astype('str')

In [76]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mix     4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

# 04. Missing Values

In [19]:
# Use isnull() function is used to find missing observations
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [21]:
# Create a subset of the df with only the values in question AS df_nan
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [23]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

##### Can use median value to impute at this stage
df['column with missing'].fillna(median value, inplace=True)

In [26]:
# Before making this new dataframe, compare the number of rows in your current df with the number in your subset once the missing rows have been removed
df_prods.shape

(49693, 5)

In [28]:
# Create a new df without missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [78]:
df_nan.describe()

         product_id    aisle_id  department_id     prices
count     16.000000   16.000000      16.000000  16.000000
mean    6684.000000   89.937500      10.937500  13.012500
std    12836.665242   33.731229       4.639953   3.881731
min       34.000000   26.000000       1.000000   1.200000
25%      459.250000   70.750000       7.750000  12.175000
50%     2413.000000   98.500000      11.500000  13.650000
75%     3872.750000  120.000000      14.500000  14.425000
max    40440.000000  126.000000      16.000000  20.900000

In [80]:
df_nan.median()

product_id       2413.0
product_name        NaN
aisle_id           98.5
department_id      11.5
prices            13.65
dtype: object

In [82]:
df_prods_clean.shape

(49677, 5)

##### Rather than creating an entirely new dataframe, you’re overwriting df_prods with a new version
df_prods.dropna(inplace = True)
If you wanted to use this command to drop only the NaNs from a particular column
df_prods.dropna(subset = [‘product_name’], inplace = True)

# 05. Duplicates

In [33]:
# create a new subset of df_prods_clean—df_dups—containing only rows that are duplicates.
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [35]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [37]:
#  check the current number of rows in your df_prods_clean dataframe so that you can compare the number after removing the duplicates
df_prods_clean.shape

(49677, 5)

In [39]:
# create a new dataframe that doesn’t include the duplicates you just identified using the drop_duplicates() function:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [41]:
df_prods_clean_no_dups.shape

(49672, 5)

# 06. Export File

In [108]:
# Export new products df
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

# 07. TASK

## Step 2 Data issue review

In [43]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

##### days_since_prior_order: 
Min:0 Could indicate same-day orders or missing data (a significant number of 0 values might indicate same-day orders or missing data).
Max: 30 Seems to be a capped value. Check if many values are exactly 30, as this could indicate system-imposed limits rather than real behavior.

##### days_since_proir_order:
days_since_prior_order column has a different count compared to other columns.
206,209 missing values in the days_since_prior_order column (3,421,083 - 3,214,874 = 206,209).

##### order_number:
max value of 100 which could suggest that the order_number column is capped or limited to a maximum value.
Analysis may show an underestimate of true values.

## Step 3 Mixed data types

In [48]:
# Code for checking mixed types in columns for df_ords
# code checks each column for mixed data types by comparing the type of each element to the type of the first element.
for col in df_ords.columns.tolist():
    weird = (df_ords[col].map(type) != type(df_ords[col].iloc[0])).any()
    if weird:
        print(f"Mixed data types found in column: {col}")

Mixed data types found in column: order_id
Mixed data types found in column: user_id
Mixed data types found in column: order_number
Mixed data types found in column: orders_day_of_week
Mixed data types found in column: order_hour_of_day
Mixed data types found in column: days_since_last_order

##### result shows that mixed data types were detected in all columns of the df, indicating potential inconsistencies or issues with data formatting.

## Step 4 Fix mixed type data

In [51]:
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int64
 1   user_id                int64
 2   order_number           int64
 3   orders_day_of_week     int64
 4   order_hour_of_day      int64
 5   days_since_last_order  float64
dtypes: float64(1), int64(5)
memory usage: 156.6 MB

##### Since all numeric columns (int64 and float64) are already consistent in type, no further action is needed for those.

## Step 5 Missing Values

In [54]:
# Use isnull() function is used to find missing observations
df_ords.isnull().sum()

order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

##### as per Step 2. 206,209 missing values in the days_since_prior_order column (3,421,083 - 3,214,874 = 206,209).

## Step 6 Address Missing Values

In [86]:
# Create subset of the dataframe that contains the nulls
df_ords_nan = df_ords[df_ords['days_since_last_order'].isnull() == True]

In [98]:
df_ords['days_since_last_order'] = df_ords['days_since_last_order'].fillna(6)

In [100]:
df_ords[df_ords['order_number']==1]

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,0.0
11,2168274,2,1,2,11,0.0
26,1374495,3,1,1,14,0.0
39,3343014,4,1,6,11,0.0
45,2717275,5,1,3,12,0.0
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,0.0
3420934,3189322,206206,1,3,18,0.0
3421002,2166133,206207,1,6,19,0.0
3421019,2227043,206208,1,1,15,0.0
3421069,3154581,206209,1,3,11,0.0

In [102]:
df_ords.shape

(3421083, 6)

In [61]:
# Use isnull() function is used to find missing observations
df_ords.isnull().sum()

order_id                 0
user_id                  0
order_number             0
orders_day_of_week       0
order_hour_of_day        0
days_since_last_order    0
dtype: int64

##### My new dataframe has the same 3421083 row and 6 columns as previous

##### I used this method because instead of removing the missing values for days_since_last_order column, it is more appropriate to impute the NaN values with 0 values. Because as you guess these orders are the customers' first orders (think like there were zero days prior orders were made).

## Step 7 check duplicate values

In [104]:
# create a new subset of df_ords_clean with df_ords_dups — containing only rows that are duplicates.
df_ords_dups = df_ords[df_ords.duplicated()]

In [106]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

## Step 8 Address duplicates

##### The absence of rows in df_ords_dups confirms that there are no duplicate values in the df_ords_clean DataFrame.

## Step 9 Export files

In [110]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked_2.csv'), index=False)